## Анализ набора данных с использованием `pandas` (2)

In [2]:
import pandas as pd
df = pd.read_csv('Employee.csv')

In [9]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

Постройте сводную таблицу, показывающую средний возраст сотрудников в каждом городе.

In [3]:
df.pivot_table(values="Age", index="City", aggfunc="mean")

                 Age
City
Bangalore  29.594255
New Delhi  29.121003
Pune       29.288644

In [4]:
df.groupby('City')['Age'].mean()

City
Bangalore    29.594255
New Delhi    29.121003
Pune         29.288644
Name: Age, dtype: float64

Рассчитайте количество сотрудников по каждому уровню образования и их средний возраст.

In [5]:
df.groupby('Education').agg({'Education': 'count', 'Age': 'mean'})

           Education        Age
Education
Bachelors       3601  29.422938
Masters          873  29.290951
PHD              179  29.296089

In [6]:
ed_stats = df.groupby("Education").agg(EmployeeCount=("Age", "count"), AverageAge=("Age", "mean"))
print(ed_stats)

           EmployeeCount  AverageAge
Education
Bachelors           3601   29.422938
Masters              873   29.290951
PHD                  179   29.296089

In [7]:
df.groupby('Education')['Education'].count(), df.groupby('Education')['Age'].mean()

(Education
 Bachelors    3601
 Masters       873
 PHD           179
 Name: Education, dtype: int64,
 Education
 Bachelors    29.422938
 Masters      29.290951
 PHD          29.296089
 Name: Age, dtype: float64)

Создайте сводную таблицу, показывающую количество мужчин и женщин в каждом уровне оплаты (Payment Tier).

In [8]:
df.groupby(by=['Gender', 'PaymentTier']).agg({'Gender': 'count'})

                    Gender
Gender PaymentTier
Female 1               131
       2               605
       3              1139
Male   1               112
       2               313
       3              2353

Составьте сводную таблицу, отражающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от того, были ли они когда-либо исключены из проектов на месяц или более.

In [10]:
df.pivot_table(values="LeaveOrNot", index="EverBenched", aggfunc=lambda x: x.mean() * 100)

             LeaveOrNot
EverBenched
No            33.125749
Yes           45.397490

In [16]:
mas = [0,0,0,0,1,0,1,0]
print(2/8*100)
print(sum(mas)/len(mas)*100)

25.0
25.0

Постройте сводную таблицу, отображающую медианный опыт работы в текущей области в зависимости от уровня образования и пола сотрудников.

In [17]:
df.groupby(['Education','Gender']).agg(MedianExperienceInCurrentDomain=('ExperienceInCurrentDomain','median'))

                  MedianExperienceInCurrentDomain
Education Gender
Bachelors Female                              3.0
          Male                                3.0
Masters   Female                              2.0
          Male                                3.0
PHD       Female                              3.0
          Male                                3.0

Рассчитайте количество сотрудников по каждому году присоединения к компании и их средний возраст.

In [18]:
df.groupby('JoiningYear').agg({'JoiningYear': 'count', 'Age': 'mean'})

             JoiningYear        Age
JoiningYear
2012                 504  29.603175
2013                 669  29.008969
2014                 699  29.290415
2015                 781  29.476312
2016                 525  29.552381
2017                1108  29.416968
2018                 367  29.525886

Создайте сводную таблицу, показывающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от уровня образования и города, в котором они работают.

In [20]:
df.pivot_table(values="LeaveOrNot", columns="Education", index="City", aggfunc=lambda x: x.mean() * 100)

Education  Bachelors    Masters        PHD
City
Bangalore  24.025341  70.161290  28.846154
New Delhi  18.063315  47.001934  25.242718
Pune       53.260870  41.379310  16.666667

Составьте сводную таблицу, отображающую средний возраст сотрудников, которые были когда-либо исключены из проектов, и тех, кто не был, в зависимости от уровня оплаты.

In [21]:
df.groupby(["PaymentTier", "EverBenched"])['Age'].mean()

PaymentTier  EverBenched
1            No             29.644444
             Yes            28.944444
2            No             29.204848
             Yes            28.989247
3            No             29.460160
             Yes            29.217984
Name: Age, dtype: float64

Постройте сводную таблицу, показывающую средний возраст сотрудников, которые покинули компанию в следующие два года, в зависимости от города и опыта работы в текущей области.

In [22]:
df[df['LeaveOrNot'] == 1].pivot_table(
    index='City',                          
    columns='ExperienceInCurrentDomain',   
    values='Age',
    aggfunc='mean'                       
)

ExperienceInCurrentDomain,0,1,2,3,4,5,6,7
City,,,,,,,,
Bangalore,30.822222,30.975309,29.413793,28.669492,28.115789,28.905660,38.5,39.0
New Delhi,30.000000,30.090909,29.724771,27.552239,27.472973,27.984375,NaN,NaN
Pune,31.833333,31.283784,28.406897,28.359649,27.898438,28.728814,NaN,NaN

Создайте сводную таблицу, отображающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от уровня оплаты и того, были ли они когда-либо исключены из проектов на месяц или более.

In [23]:
df.groupby(['PaymentTier', 'EverBenched'])['LeaveOrNot'].mean() * 100

PaymentTier  EverBenched
1            No             35.555556
             Yes            50.000000
2            No             57.575758
             Yes            80.645161
3            No             26.496000
             Yes            36.239782
Name: LeaveOrNot, dtype: float64